-DATASET CSV copy-fault-tests/rel-table-multiplicity-violation
--

-CASE ManyOneMultiplicityViolationError
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/rel-table-multiplicity-violation/eKnows.csv"
---- error
Copy exception: Node(nodeOffset: 0) has more than one neighbour in table knows in the fwd direction, which violates the rel multiplicity constraint.

-CASE OneManyMultiplicityViolationError
-STATEMENT COPY teaches FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/rel-table-multiplicity-violation/eTeaches.csv"
---- error
Copy exception: Node(nodeOffset: 2) has more than one neighbour in table teaches in the bwd direction, which violates the rel multiplicity constraint.

-CASE OneOneMultiplicityViolationError
-STATEMENT COPY matches FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/rel-table-multiplicity-violation/eMatches.csv"
---- error
Copy exception: Node(nodeOffset: 1) has more than one neighbour in table matches in the fwd direction, which violates the rel multiplicity constraint.

-CASE ManyOneMultiplicityViolationIgnoreErrors
-STATEMENT COPY knows FROM "${KUZU_ROOT_DIRECTORY}/dataset/copy-fault-tests/rel-table-multiplicity-violation/eKnows.csv"(IGNORE_ERRORS=true)
---- ok
-STATEMENT MATCH (a:person)-[k:knows]->(b:person) RETURN a.ID, b.ID
---- 3
0|1
1|2
3|4
-STATEMENT call show_warnings() RETURN message
---- 3
Copy exception: Node(nodeOffset: 0) has more than one neighbour in table knows in the fwd direction, which violates the rel multiplicity constraint.
Copy exception: Node(nodeOffset: 1) has more than one neighbour in table knows in the fwd direction, which violates the rel multiplicity constraint.
Copy exception: Node(nodeOffset: 1) has more than one neighbour in table knows in the fwd direction, which violates the rel multiplicity constraint.
