-DATASET CSV empty

--

-CASE ScanDuckDBTable
-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/duckdb/build/libduckdb.kuzu_extension"
---- ok
#-LOG AttachUnsupportedTableError
#-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/duckdb/test/duckdb_database/tinysnb.db' as tinysnb (dbtype duckdb);
#---- error
#Binder exception: Unsupported duckdb type: ENUM('sad', 'ok', 'happy').
-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/duckdb/test/duckdb_database/tinysnb.db' as tinysnb (dbtype duckdb, skip_unsupported_table = true);
---- 1
Attached database successfully.
-STATEMENT LOAD FROM tinysnb.person RETURN *;
---- 8
0|Alice|1|True|False|35|5.000000|1900-01-01|2011-08-20 11:25:30|3 years 2 days 13:02:00|[10,5]|[Aida]|[[10,8],[6,7,8]]|1.731000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a11|[96,54,86,92]
10|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|2|False|True|83|4.900000|1990-11-27|2023-02-21 13:25:30|3 years 2 days 13:02:00|[10,11,12,3,4,5,6,7]|[Ad,De,Hi,Kye,Orlan]|[[7],[10],[6,7]]|1.323000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a18|[77,64,100,54]
2|Bob|2|True|False|30|5.100000|1900-01-01|2008-11-03 15:25:30.000526|10 years 5 months 13:00:00.000024|[12,8]|[Bobby]|[[8,9],[9,10]]|0.990000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a12|[98,42,93,88]
3|Carol|1|False|True|45|5.000000|1940-06-22|1911-08-20 02:32:21|48:24:11|[4,5]|[Carmen,Fred]|[[8,10]]|1.000000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a13|[91,75,21,95]
5|Dan|2|False|True|20|4.800000|1950-07-23|2031-11-30 12:25:30|10 years 5 months 13:00:00.000024|[1,9]|[Wolfeschlegelstein,Daniel]|[[7,4],[8,8],[9]]|1.300000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a14|[76,88,99,89]
7|Elizabeth|1|False|True|20|4.700000|1980-10-26|1976-12-23 11:21:42|48:24:11|[2]|[Ein]|[[6],[7],[8]]|1.463000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a15|[96,59,65,88]
8|Farooq|2|True|False|25|4.500000|1980-10-26|1972-07-31 13:22:30.678559|00:18:00.024|[3,4,5,6,7]|[Fesdwe]|[[8]]|1.510000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a16|[80,78,34,83]
9|Greg|2|False|False|40|4.900000|1980-10-26|1976-12-23 11:21:42|10 years 5 months 13:00:00.000024|[1]|[Grad]|[[10]]|1.600000|a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a17|[43,83,67,43]
-STATEMENT LOAD FROM tinysnb.knows RETURN *;
---- 14
0|2|2021-06-30|1986-10-21 21:08:31.521|10 years 5 months 13:00:00.000024|[rnme,m8sihsdnf2990nfiwf]|{locations: ['toronto','waterloo'], transfer: {"day": 2021-01-02, amount: [100,200]}}|1|{a=b}
0|3|2021-06-30|1946-08-25 19:07:22|20 years 30 days 48:00:00|[njnojppo9u0jkmf,fjiojioh9h9h89hph]|{locations: , transfer: {"day": , amount: }}|2020-10-10|{c=d, e=f, 1=2}
0|5|2021-06-30|2012-12-11 20:07:22|10 days|[ioji232,jifhe8w99u43434]|{locations: ['shanghai'], transfer: {"day": 1990-09-10, amount: [10]}}|nice weather|
2|0|2021-06-30|1946-08-25 19:07:22|10 years 5 months 13:00:00.000024|[2huh9y89fsfw23,23nsihufhw723]|{locations: ['paris'], transfer: {"day": 2000-01-01, amount: [20,5000]}}|4|
2|3|1950-05-14|1946-08-25 19:07:22|00:23:00|[fwehu9h9832wewew,23u9h989sdfsss]|{locations: ['paris'], transfer: {"day": 2011-05-01, amount: [2000,5340]}}|cool stuff found|
2|5|1950-05-14|2012-12-11 20:07:22|20 years 30 days 48:00:00|[fwh9y81232uisuiehuf,ewnuihxy8dyf232]|{locations: ['vancouver'], transfer: {"day": 2020-01-01, amount: [120,50]}}|matthew perry|
3|0|2021-06-30|2002-07-31 11:42:53.12342|40 days 30:00:00|[fnioh8323aeweae34d,osd89e2ejshuih12]|{locations: ['london','toronto'], transfer: {"day": 2012-11-21, amount: [223,5230]}}|10|
3|2|1950-05-14|2007-02-12 12:11:42.123|00:28:00.03|[fwh983-sdjisdfji,ioh89y32r2huir]|{locations: ['paris','beijing'], transfer: {"day": 2011-03-11, amount: [2323,50]}}|1|
3|5|2000-01-01|1998-10-02 13:09:22.423|00:00:00.3|[psh989823oaaioe,nuiuah1nosndfisf]|{locations: [], transfer: {"day": 1980-11-21, amount: [20,5]}}|2|
5|0|2021-06-30|1936-11-02 11:02:01|00:00:00.00048|[fwewe]|{locations: ['shanghai','nanjing'], transfer: {"day": 1998-11-12, amount: [22,53240]}}|15|
5|2|1950-05-14|1982-11-11 13:12:05.123|00:23:00|[fewh9182912e3,h9y8y89soidfsf,nuhudf78w78efw,hioshe0f9023sdsd]|{locations: ['paris'], transfer: {"day": 2000-01-01, amount: [20,5000]}}|happy new year|
5|3|2000-01-01|1999-04-21 15:12:11.42|48:00:00.052|[23h9sdslnfowhu2932,shuhf98922323sf]|{locations: ['paris'], transfer: {"day": 2000-01-01, amount: [20,5000]}}|4|
7|8|1905-12-12|2025-01-01 11:22:33.52|00:47:58|[ahu2333333333333,12weeeeeeeeeeeeeeeeee]|{locations: ['toronto','thisisalongcityname'], transfer: {"day": 1930-11-22, amount: [18,323]}}|8|
7|9|1905-12-12|2020-03-01 12:11:41.6552|00:47:58|[peweeeeeeeeeeeeeeeee,kowje9w0eweeeeeeeee]|{locations: ['waterloo'], transfer: {"day": 2000-01-01, amount: [1000,5000]}}|10|

-STATEMENT CREATE EXTERNAL NODE TABLE duck_person AS tinysnb.person (PRIMARY KEY (ID));
---- 1
Table duck_person has been created.
-STATEMENT COPY duck_person FROM (LOAD FROM tinysnb.person RETURN ID);
---- ok
-STATEMENT MATCH (a:duck_person) RETURN a.ID, a.fName;
---- 8
0|Alice
10|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
2|Bob
3|Carol
5|Dan
7|Elizabeth
8|Farooq
9|Greg
-STATEMENT CREATE EXTERNAL REL TABLE duck_knows AS tinysnb.knows (FROM duck_person TO duck_person)
---- 1
Table duck_knows has been created.
-STATEMENT COPY duck_knows FROM (LOAD FROM tinysnb.knows RETURN `from`, `to`);
---- 1

#-STATEMENT MATCH (a:duck_person)-[:duck_knows]->(b:duck_person) RETURN a.fName, b.fName;
#---- 1
#1



#-STATEMENT LOAD FROM tinysnb.organisation RETURN *;
#---- 3
#1|ABFsUni|325|3.700000|-2|10 years 5 months 13 hours 24 us|3 years 5 days|1.000000|{revenue: 138, "location": ['toronto','montr,eal'], stock: {price: [96,56], volume: 1000}}|3.12
#4|CsWork|934|4.100000|-100|2 years 4 days 10 hours|26 years 52 days 48:00:00|0.780000|{revenue: 152, "location": ["vanco,uver north area"], stock: {price: [15,78,671], volume: 432}}|abcd
#6|DEsWork|824|4.100000|7|2 years 4 hours 22 us 34 minutes|82:00:00.1|0.520000|{revenue: 558, "location": ['very long city name','new york'], stock: {price: [22], volume: 99}}|2023-12-15
#-STATEMENT LOAD FROM tinysnb.movies RETURN *;
#---- 3
#Roma|298|the movie is very interesting and funny|{rating: 1223.000000, stars: 100, "views": 10003, "release": 2011-02-11 16:44:22, release_ns: 2011-02-11 16:44:22.123456, release_ms: 2011-02-11 16:44:22.123, release_sec: 2011-02-11 16:44:22, release_tz: 2011-02-11 16:44:22.123456+00, film: 2013-02-22, u8: 1, u16: 15, u32: 200, u64: 4, hugedata: -15}|pure ascii characters|{}
#Sóló cón tu párejâ|126| this is a very very good movie|{rating: 5.300000, stars: 2, "views": 152, "release": 2011-08-20 11:25:30, release_ns: 2011-08-20 11:25:30.123456, release_ms: 2011-08-20 11:25:30.123, release_sec: 2011-08-20 11:25:30, release_tz: 2011-08-20 11:25:30.123456+00, film: 2012-05-11, u8: 220, u16: 20, u32: 1, u64: 180, hugedata: 1844674407370955161811111111}|\xAA\xABinteresting\x0B|{audience1=52, audience53=42}
#The 😂😃🧘🏻‍♂️🌍🌦️🍞🚗 movie|2544| the movie is very very good|{rating: 7.000000, stars: 10, "views": 982, "release": 2018-11-13 13:33:11, release_ns: 2018-11-13 13:33:11.123456, release_ms: 2018-11-13 13:33:11.123, release_sec: 2018-11-13 13:33:11, release_tz: 2018-11-13 13:33:11.123456+00, film: 2014-09-12, u8: 12, u16: 120, u32: 55, u64: 1, hugedata: -1844674407370955161511}|\xAB\xCD|{audience1=33}
#-STATEMENT LOAD FROM tinysnb.tableOfTypes RETURN count(*);
#---- 1
#49999
#-STATEMENT LOAD FROM tinysnb.tableOfTypes WHERE id = 49992 or id = 28532 RETURN *;
#---- 2
#28532|74|72.472423|True|1977-08-16|TKn|[94,92]|[AUSrJTUWVOESDor,ODOS6RfqMhsFO9aFUa,ziauQj]|[[123,55,181],[32]]|{ID: 666, "name": DiqSQ5u5UhS8aZi}
#49992|50|31.582059|False|2056-05-02||[62,24,94]|[LpQO8OT3x45a]|[[268,281,166],[144,16,126,208,298],[22,287]]|{ID: 936, "name": sGPSafxMAhKiP}
#-STATEMENT LOAD FROM tinysnb.person1 RETURN *;
#---- error
#Catalog exception: person1 does not exist in catalog.
#-STATEMENT DETACH tinysnb;
#---- 1
#Detached database successfully.
#-STATEMENT LOAD FROM tinysnb.person RETURN *;
#---- error
#Binder exception: No database named tinysnb has been attached.
#-LOG AttachMultipleDuckDB
#-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/duckdb/test/duckdb_database/tinysnb.db' (dbtype duckdb, skip_unsupported_table = true);
#---- 1
#Attached database successfully.
#-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/duckdb/test/duckdb_database/other.db' as Other1 (dbtype duckdb, skip_unsupported_table = true);
#---- 1
#Attached database successfully.
#-STATEMENT CALL SHOW_TABLES() RETURN *;
#---- 6
#movies|ATTACHED|tinysnb(DUCKDB)|
#organisation|ATTACHED|tinysnb(DUCKDB)|
#person|ATTACHED|Other1(DUCKDB)|
#person|ATTACHED|tinysnb(DUCKDB)|
#tableOfTypes1|ATTACHED|tinysnb(DUCKDB)|
#tableOfTypes|ATTACHED|tinysnb(DUCKDB)|
#-STATEMENT LOAD FROM other1.person RETURN *;
#---- 4
#1
#2
#3
#5
#-STATEMENT LOAD FROM tinysnb.person RETURN count(*);
#---- 1
#8
#-LOG UseDatabaseStatement
#-STATEMENT USE other1;
#---- 1
#Used database successfully.
#-STATEMENT LOAD FROM person RETURN *;
#---- 4
#1
#2
#3
#5
#-STATEMENT USE tinysnb;
#---- 1
#Used database successfully.
#-STATEMENT LOAD FROM person RETURN count(*);
#---- 1
#8
#-STATEMENT LOAD FROM other1.person RETURN count(*);
#---- 1
#4
#-STATEMENT CALL CLEAR_ATTACHED_DB_CACHE() RETURN *;
#---- ok
#-STATEMENT LOAD FROM other1.person RETURN count(*);
#---- 1
#4
#-STATEMENT CALL TABLE_INFO('other1.person') RETURN *;
#---- 1
#0|id|INT32
#-STATEMENT CALL TABLE_INFO('tinysnb.person') RETURN *;
#---- 16
#0|ID|INT64
#1|fName|STRING
#2|gender|INT64
#3|isStudent|BOOL
#4|isWorker|BOOL
#5|age|INT64
#6|eyeSight|DOUBLE
#7|birthdate|DATE
#8|registerTime|TIMESTAMP
#9|lastJobDuration|INTERVAL
#10|workedHours|INT64[]
#11|usedNames|STRING[]
#12|courseScoresPerTerm|INT64[][]
#13|height|FLOAT
#14|u|UUID
#15|grades|INT64[4]
#-LOG WrongTableName
#-STATEMENT CALL TABLE_INFO('tinysnb.personxx') RETURN *;
#---- error
#Catalog exception: personxx does not exist in catalog.
#-LOG WrongCatalogName
#-STATEMENT CALL TABLE_INFO('tinysnbxx.person') RETURN *;
#---- error
#Runtime exception: Database: tinysnbxx doesn't exist.
#
#-CASE InvalidDuckDBDatabase
#-STATEMENT LOAD FROM tinysnb1.person RETURN *;
#---- error
#Binder exception: No database named tinysnb1 has been attached.
#-STATEMENT LOAD FROM tinysnb1_person RETURN *;
#---- error
#Binder exception: Variable tinysnb1_person is not in scope.
#
#-CASE InvalidUseDatabaseName
#-STATEMENT USE NONEXIST;
#---- error
#Runtime exception: No database named NONEXIST.
#
#-CASE ScanDuckdbDatabaseWithoutExt
#-STATEMENT load extension "${KUZU_ROOT_DIRECTORY}/extension/duckdb/build/libduckdb.kuzu_extension"
#---- ok
#-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/duckdb/test/duckdb_database/dbfilewithoutext' (dbtype duckdb);
#---- ok
#-STATEMENT LOAD FROM dbfilewithoutext.persons RETURN *
#---- 2
#Jeff|32
#Wendy|28
#-LOG AttachSameDBError
#-STATEMENT ATTACH '${KUZU_ROOT_DIRECTORY}/extension/duckdb/test/duckdb_database/dbfilewithoutext' (dbtype duckdb);
#---- error
#Runtime exception: Database with name: dbfilewithoutext has already been attached.
#-LOG DetachExistDB
#-STATEMENT DETACH dbfilewithoutext;
#---- ok
#-LOG DetachNotExistDBError
#-STATEMENT DETACH dbfilewithoutext;
#---- error
#Runtime exception: Database: dbfilewithoutext doesn't exist.
#-LOG AttachNotExistDBError
#-STATEMENT ATTACH 'notexist.db' (dbtype duckdb);
#---- error
#Runtime exception: 'notexist.db' is not a valid duckdb database path.
#
#-CASE AttachDBWithoutLoadingExtension
#-STATEMENT ATTACH 'notexist.db' (dbtype duckdb);
#---- error
#Runtime exception: No loaded extension can handle database type: duckdb.
#Did you forget to load duckdb extension?
#You can load it by: load extension duckdb;
#-STATEMENT ATTACH 'notexist.db' (dbtype postgres);
#---- error
#Runtime exception: No loaded extension can handle database type: postgres.
#Did you forget to load postgres extension?
#You can load it by: load extension postgres;
#-STATEMENT ATTACH 'notexist.db' (dbtype sqlite);
#---- error
#Runtime exception: No loaded extension can handle database type: sqlite.
